#include <iostream>
#include <cmath>

/*
Задание 3
Входные данные для проверки:

*/

int main()
{
    double x, y;
    std::cin >> x >> y;

    std::cout << " " << std::endl;
}
