# # Ввод числа с клавиатуры
# num = int(input("Введите число в десятичной системе счисления: "))

# # Перевод числа в двоичную систему счисления
# binary = bin(num)[2:]

# # Перевод числа в восьмеричную систему счисления
# octal = oct(num)[2:]

# # Перевод числа в шестнадцатеричную систему счисления
# hexadecimal = hex(num)[2:]

# # Вывод результатов
# print("Двоичное представление числа: ", binary)
# print("Восьмеричное представление числа: ", octal)
# print("Шестнадцатеричное представление числа: ", hexadecimal)

print(int('C06EA5', 16))

# # Перевод числа в десятичную систему счисления
# decimal = num

# # Сложение чисел
# sum = num + decimal

# # Вычитание чисел
# diff = num - decimal

# # Умножение чисел
# prod = num * decimal

# # Вывод результатов
# print("Сумма чисел: ", sum)
# print("Разность чисел: ", diff)
# print("Произведение чисел: ", prod)
